In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame([[np.nan, 2, np.nan, 0], [1, np.nan, np.nan, np.nan], [np.nan, 3, np.nan, 4], [np.nan, 3, np.nan, 4]],
                 columns=['A', 'B', 'C', 'D'])
df

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  1.0  NaN NaN  NaN
2  NaN  3.0 NaN  4.0
3  NaN  3.0 NaN  4.0

In [3]:
df_fill = df[['A', 'B', 'C', 'D']].mean()
df.fillna(df_fill)

     A         B   C         D
0  1.0  2.000000 NaN  0.000000
1  1.0  2.666667 NaN  2.666667
2  1.0  3.000000 NaN  4.000000
3  1.0  3.000000 NaN  4.000000

In [5]:
df.B.value_counts()

3.0    2
2.0    1
Name: B, dtype: int64

In [6]:
df1 = pd.DataFrame(columns=['name', 'position', 'region'], data=[['siba', 2, 'IN'], ['sibu', 1, 'US'], ['babu', 3, 'JA'], ['sanu', 4, 'CH']])
df1

   name  position region
0  siba         2     IN
1  sibu         1     US
2  babu         3     JA
3  sanu         4     CH

In [9]:
df1.name.value_counts()

siba    1
sibu    1
babu    1
sanu    1
Name: name, dtype: int64

In [21]:
df1.sort_values('position', ascending=False).head(1).reset_index()[['name', 'position']]

   name  position
0  sanu         4

In [15]:
df1.loc[df1['position']==2]

   name  position region
0  siba         2     IN

In [22]:
75/57

1.3157894736842106

In [23]:
70/53

1.320754716981132

In [24]:
40/3

13.333333333333334

In [25]:
68/19

3.5789473684210527

# Problem 1

In [42]:
# data1 = [[30, 70,40], [57, 65,75], [55,70, 53], [40, 30, 3], [19, 58, 68]]
data1 = [[1108037, 1099167, 1030199], [854983, 945460, 953547], [1194853,1423283, 653489]]
data1

[[1108037, 1099167, 1030199],
 [854983, 945460, 953547],
 [1194853, 1423283, 653489]]

In [43]:
# x1 = 77.970
x1 = 147.7092

In [50]:
final_result = []
for item in data1:
    z_value = 0
    temp_data = []
    for inside_item in item:
        temp_data.append(abs(round(x1-inside_item,2)))
        print(temp_data)
    near_point = temp_data.index(min(temp_data))
    far_point = temp_data.index(max(temp_data))
    print('near and far points', item[near_point], item[far_point])
    z_value = (item[near_point]/item[far_point])
    final_result.append(z_value)
    
print(final_result.index(max(final_result)))

[1107889.29]
[1107889.29, 1099019.29]
[1107889.29, 1099019.29, 1030051.29]
near and far points 1030199 1108037
[854835.29]
[854835.29, 945312.29]
[854835.29, 945312.29, 953399.29]
near and far points 854983 953547
[1194705.29]
[1194705.29, 1423135.29]
[1194705.29, 1423135.29, 653341.29]
near and far points 653489 1423283
0